app/views/workouts/show.html.erb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."workout_id" = ?  [["workout_id", 2]]
---
  <h2 class="mt-4">Exercises</h2>
  <% @workout.exercises.each do |exercise| %>