app/controllers/exercises_controller.rb

  def create
    @workout = Workout.find(params[:workout_id])
    @exercise = @workout.exercises.new(exercise_params)
    @exercise.save
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "exercises" ("name", "sets", "reps", "weight", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "testex"], ["sets", 3], ["reps", 12], ["weight", 20], ["workout_id", 2], ["created_at", "2026-04-13 15:30:48.957177"], ["updated_at", "2026-04-13 15:30:48.957177"]]

  def destroy
    @workout = Workout.find(params[:workout_id])
    @exercise = Exercise.find(params[:id])
    @exercise.destroy
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 1]]