app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def show
    @workout = Workout.find(params[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @workout = Workout.find(params[:id])

INSERT INTO "workouts" ("name", "date", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", ""], ["date", "2026-04-18"], ["notes", "testing no name"], ["created_at", "2026-04-18 16:17:49.778587"], ["updated_at", "2026-04-18 16:17:49.778587"]]
---
  def create
    @workout = Workout.new(workout_params)
    if @workout.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "workouts" SET "notes" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["notes", "Upper Body Push\n- Incline Bench Press\n- Flat Bench Press"], ["updated_at", "2026-04-13 15:18:26.962137"], ["id", 2]]
---
  def update
    @workout = Workout.find(params[:id])
    if @workout.update(workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 9]]
---
  def destroy
    @workout = Workout.find(params[:id])
    @workout.destroy